paypal-connector-test/src/test/resources/artifacts/ESB/config/soapRequests/paypal/grantTokenFromRefreshToken.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn="wso2.connector.paypal.granttokenfromrefreshtoken">
   <soapenv:Header/>
   <soapenv:Body>
      <urn:paypalApiUrl>https://api.sandbox.paypal.com</urn:paypalApiUrl>
      <urn:authorization>Bearer 7RDA.3yMKBJrpm.wu-3FPuJ1r7mXqfe6mcIehN64CWE</urn:authorization>
      <urn:grantType>code</urn:grantType>
      <urn:refreshToken>wqdI69Yfsu3ShU2IShvd2d</urn:refreshToken>
      <urn:scope>profile email address</urn:scope>
   </soapenv:Body>
</soapenv:Envelope>
